Public Attributes | List of all members
API_ListDataSetType Struct Reference
Old Listing
Representation of a listdata set. More...
#include <APIdefs_ListData.h>
 Public Attributes
 Int32  | setIndex
index of the set of the listing database
 Int32  | compLibInd
index of components library part
 Int32  | descLibInd
index of the descriptors library part
 Int32  | unitLibInd
index of the units library part
 Int32  | keyLibInd
index of the keys library part
 Int32  | critLibInd
index of the criteria's library part
 Int32  | listSetupLibInd
index of the list setup library part
 char  | setName [API_NameLen]
name of the set of the listing database
Detailed Description
Representation of a listdata set.
Remarks
This structure is used when you get information about a set of the listing database. See the ACAPI_OldListing_GetSet function.